synthetos/Motate/MotateProject/motate/cmsis/TARGET_Atmel/sam4l/include/component/flashcalw.h
/* -------- FLASHCALW_FGPFRLO : (FLASHCALW Offset: 0x18) (R/W 32) Flash Controller General Purpose Fuse Register Low -------- */
#define FLASHCALW_FGPFRLO_OFFSET    0x18         /**< \brief (FLASHCALW_FGPFRLO offset) Flash Controller General Purpose Fuse Register Low */

#define FLASHCALW_FGPFRLO_LOCK0_Pos 0            /**< \brief (FLASHCALW_FGPFRLO) Lock Bit 0 */
#define FLASHCALW_FGPFRLO_LOCK0     (0x1u << FLASHCALW_FGPFRLO_LOCK0_Pos)
#define FLASHCALW_FGPFRLO_LOCK1_Pos 1            /**< \brief (FLASHCALW_FGPFRLO) Lock Bit 1 */
#define FLASHCALW_FGPFRLO_LOCK1     (0x1u << FLASHCALW_FGPFRLO_LOCK1_Pos)
#define FLASHCALW_FGPFRLO_LOCK2_Pos 2            /**< \brief (FLASHCALW_FGPFRLO) Lock Bit 2 */
#define FLASHCALW_FGPFRLO_LOCK2     (0x1u << FLASHCALW_FGPFRLO_LOCK2_Pos)
#define FLASHCALW_FGPFRLO_LOCK3_Pos 3            /**< \brief (FLASHCALW_FGPFRLO) Lock Bit 3 */
#define FLASHCALW_FGPFRLO_LOCK3     (0x1u << FLASHCALW_FGPFRLO_LOCK3_Pos)
#define FLASHCALW_FGPFRLO_LOCK4_Pos 4            /**< \brief (FLASHCALW_FGPFRLO) Lock Bit 4 */
#define FLASHCALW_FGPFRLO_LOCK4     (0x1u << FLASHCALW_FGPFRLO_LOCK4_Pos)
#define FLASHCALW_FGPFRLO_LOCK5_Pos 5            /**< \brief (FLASHCALW_FGPFRLO) Lock Bit 5 */
#define FLASHCALW_FGPFRLO_LOCK5     (0x1u << FLASHCALW_FGPFRLO_LOCK5_Pos)
#define FLASHCALW_FGPFRLO_LOCK6_Pos 6            /**< \brief (FLASHCALW_FGPFRLO) Lock Bit 6 */
#define FLASHCALW_FGPFRLO_LOCK6     (0x1u << FLASHCALW_FGPFRLO_LOCK6_Pos)
#define FLASHCALW_FGPFRLO_LOCK7_Pos 7            /**< \brief (FLASHCALW_FGPFRLO) Lock Bit 7 */
#define FLASHCALW_FGPFRLO_LOCK7     (0x1u << FLASHCALW_FGPFRLO_LOCK7_Pos)
#define FLASHCALW_FGPFRLO_LOCK8_Pos 8            /**< \brief (FLASHCALW_FGPFRLO) Lock Bit 8 */
#define FLASHCALW_FGPFRLO_LOCK8     (0x1u << FLASHCALW_FGPFRLO_LOCK8_Pos)
#define FLASHCALW_FGPFRLO_LOCK9_Pos 9            /**< \brief (FLASHCALW_FGPFRLO) Lock Bit 9 */
#define FLASHCALW_FGPFRLO_LOCK9     (0x1u << FLASHCALW_FGPFRLO_LOCK9_Pos)
#define FLASHCALW_FGPFRLO_LOCK10_Pos 10           /**< \brief (FLASHCALW_FGPFRLO) Lock Bit 10 */
#define FLASHCALW_FGPFRLO_LOCK10    (0x1u << FLASHCALW_FGPFRLO_LOCK10_Pos)
#define FLASHCALW_FGPFRLO_LOCK11_Pos 11           /**< \brief (FLASHCALW_FGPFRLO) Lock Bit 11 */
#define FLASHCALW_FGPFRLO_LOCK11    (0x1u << FLASHCALW_FGPFRLO_LOCK11_Pos)
#define FLASHCALW_FGPFRLO_LOCK12_Pos 12           /**< \brief (FLASHCALW_FGPFRLO) Lock Bit 12 */
#define FLASHCALW_FGPFRLO_LOCK12    (0x1u << FLASHCALW_FGPFRLO_LOCK12_Pos)
#define FLASHCALW_FGPFRLO_LOCK13_Pos 13           /**< \brief (FLASHCALW_FGPFRLO) Lock Bit 13 */
#define FLASHCALW_FGPFRLO_LOCK13    (0x1u << FLASHCALW_FGPFRLO_LOCK13_Pos)
#define FLASHCALW_FGPFRLO_LOCK14_Pos 14           /**< \brief (FLASHCALW_FGPFRLO) Lock Bit 14 */
#define FLASHCALW_FGPFRLO_LOCK14    (0x1u << FLASHCALW_FGPFRLO_LOCK14_Pos)
#define FLASHCALW_FGPFRLO_LOCK15_Pos 15           /**< \brief (FLASHCALW_FGPFRLO) Lock Bit 15 */
#define FLASHCALW_FGPFRLO_LOCK15    (0x1u << FLASHCALW_FGPFRLO_LOCK15_Pos)
#define FLASHCALW_FGPFRLO_GPF16_Pos 16           /**< \brief (FLASHCALW_FGPFRLO) General Purpose Fuse 16 */
#define FLASHCALW_FGPFRLO_GPF16     (0x1u << FLASHCALW_FGPFRLO_GPF16_Pos)
#define FLASHCALW_FGPFRLO_GPF17_Pos 17           /**< \brief (FLASHCALW_FGPFRLO) General Purpose Fuse 17 */
#define FLASHCALW_FGPFRLO_GPF17     (0x1u << FLASHCALW_FGPFRLO_GPF17_Pos)
#define FLASHCALW_FGPFRLO_GPF18_Pos 18           /**< \brief (FLASHCALW_FGPFRLO) General Purpose Fuse 18 */
#define FLASHCALW_FGPFRLO_GPF18     (0x1u << FLASHCALW_FGPFRLO_GPF18_Pos)
#define FLASHCALW_FGPFRLO_GPF19_Pos 19           /**< \brief (FLASHCALW_FGPFRLO) General Purpose Fuse 19 */
#define FLASHCALW_FGPFRLO_GPF19     (0x1u << FLASHCALW_FGPFRLO_GPF19_Pos)
#define FLASHCALW_FGPFRLO_GPF20_Pos 20           /**< \brief (FLASHCALW_FGPFRLO) General Purpose Fuse 20 */
#define FLASHCALW_FGPFRLO_GPF20     (0x1u << FLASHCALW_FGPFRLO_GPF20_Pos)
#define FLASHCALW_FGPFRLO_GPF21_Pos 21           /**< \brief (FLASHCALW_FGPFRLO) General Purpose Fuse 21 */
#define FLASHCALW_FGPFRLO_GPF21     (0x1u << FLASHCALW_FGPFRLO_GPF21_Pos)
#define FLASHCALW_FGPFRLO_GPF22_Pos 22           /**< \brief (FLASHCALW_FGPFRLO) General Purpose Fuse 22 */
#define FLASHCALW_FGPFRLO_GPF22     (0x1u << FLASHCALW_FGPFRLO_GPF22_Pos)
#define FLASHCALW_FGPFRLO_GPF23_Pos 23           /**< \brief (FLASHCALW_FGPFRLO) General Purpose Fuse 23 */
#define FLASHCALW_FGPFRLO_GPF23     (0x1u << FLASHCALW_FGPFRLO_GPF23_Pos)
#define FLASHCALW_FGPFRLO_GPF24_Pos 24           /**< \brief (FLASHCALW_FGPFRLO) General Purpose Fuse 24 */
#define FLASHCALW_FGPFRLO_GPF24     (0x1u << FLASHCALW_FGPFRLO_GPF24_Pos)
#define FLASHCALW_FGPFRLO_GPF25_Pos 25           /**< \brief (FLASHCALW_FGPFRLO) General Purpose Fuse 25 */
#define FLASHCALW_FGPFRLO_GPF25     (0x1u << FLASHCALW_FGPFRLO_GPF25_Pos)
#define FLASHCALW_FGPFRLO_GPF26_Pos 26           /**< \brief (FLASHCALW_FGPFRLO) General Purpose Fuse 26 */
#define FLASHCALW_FGPFRLO_GPF26     (0x1u << FLASHCALW_FGPFRLO_GPF26_Pos)
#define FLASHCALW_FGPFRLO_GPF27_Pos 27           /**< \brief (FLASHCALW_FGPFRLO) General Purpose Fuse 27 */
#define FLASHCALW_FGPFRLO_GPF27     (0x1u << FLASHCALW_FGPFRLO_GPF27_Pos)
#define FLASHCALW_FGPFRLO_GPF28_Pos 28           /**< \brief (FLASHCALW_FGPFRLO) General Purpose Fuse 28 */
#define FLASHCALW_FGPFRLO_GPF28     (0x1u << FLASHCALW_FGPFRLO_GPF28_Pos)
#define FLASHCALW_FGPFRLO_GPF29_Pos 29           /**< \brief (FLASHCALW_FGPFRLO) General Purpose Fuse 29 */
#define FLASHCALW_FGPFRLO_GPF29     (0x1u << FLASHCALW_FGPFRLO_GPF29_Pos)
#define FLASHCALW_FGPFRLO_GPF30_Pos 30           /**< \brief (FLASHCALW_FGPFRLO) General Purpose Fuse 30 */
#define FLASHCALW_FGPFRLO_GPF30     (0x1u << FLASHCALW_FGPFRLO_GPF30_Pos)
#define FLASHCALW_FGPFRLO_GPF31_Pos 31           /**< \brief (FLASHCALW_FGPFRLO) General Purpose Fuse 31 */
#define FLASHCALW_FGPFRLO_GPF31     (0x1u << FLASHCALW_FGPFRLO_GPF31_Pos)
#define FLASHCALW_FGPFRLO_MASK      0xFFFFFFFFu  /**< \brief (FLASHCALW_FGPFRLO) MASK Register */

/** \brief FLASHCALW APB hardware registers */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef struct {
  RwReg   FLASHCALW_FCR;      /**< \brief (FLASHCALW Offset: 0x00) Flash Controller Control Register */
  RwReg   FLASHCALW_FCMD;     /**< \brief (FLASHCALW Offset: 0x04) Flash Controller Command Register */
  RwReg   FLASHCALW_FSR;      /**< \brief (FLASHCALW Offset: 0x08) Flash Controller Status Register */
  RoReg   FLASHCALW_FPR;      /**< \brief (FLASHCALW Offset: 0x0C) Flash Controller Parameter Register */
  RoReg   FLASHCALW_VERSION;  /**< \brief (FLASHCALW Offset: 0x10) Flash Controller Version Register */
  RwReg   FLASHCALW_FGPFRHI;  /**< \brief (FLASHCALW Offset: 0x14) Flash Controller General Purpose Fuse Register High */
  RwReg   FLASHCALW_FGPFRLO;  /**< \brief (FLASHCALW Offset: 0x18) Flash Controller General Purpose Fuse Register Low */
} Flashcalw;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */
#define SECTION_FLASHCALW_FROW
#define SECTION_FLASHCALW_USER

/*@}*/

/* ************************************************************************** */
/**  SOFTWARE PERIPHERAL API DEFINITION FOR NON-VOLATILE FUSES */
/* ************************************************************************** */
/** \addtogroup fuses_api Peripheral Software API */
/*@{*/


#define FUSES_BOD18ACTION_ADDR      HFLASHC_USER
#define FUSES_BOD18ACTION_Pos       18           /**< \brief (HFLASHC_USER) BOD18 Action */
#define FUSES_BOD18ACTION_Msk       (0x3u << FUSES_BOD18ACTION_Pos)
#define FUSES_BOD18ACTION(value)    ((FUSES_BOD18ACTION_Msk & ((value) << FUSES_BOD18ACTION_Pos)))

#define FUSES_BOD18EN_ADDR          HFLASHC_USER
#define FUSES_BOD18EN_Pos           17           /**< \brief (HFLASHC_USER) BOD18 Enable */
#define FUSES_BOD18EN_Msk           (0x1u << FUSES_BOD18EN_Pos)

#define FUSES_BOD18HYST_ADDR        HFLASHC_USER
#define FUSES_BOD18HYST_Pos         20           /**< \brief (HFLASHC_USER) BOD18 Hysteresis */
#define FUSES_BOD18HYST_Msk         (0x1u << FUSES_BOD18HYST_Pos)

#define FUSES_BOD18LV_ADDR          HFLASHC_USER
#define FUSES_BOD18LV_Pos           11           /**< \brief (HFLASHC_USER) BOD18 Level */
#define FUSES_BOD18LV_Msk           (0x3Fu << FUSES_BOD18LV_Pos)
#define FUSES_BOD18LV(value)        ((FUSES_BOD18LV_Msk & ((value) << FUSES_BOD18LV_Pos)))

#define FUSES_BOD33ACTION_ADDR      HFLASHC_USER
#define FUSES_BOD33ACTION_Pos       8            /**< \brief (HFLASHC_USER) BOD33 Action */
#define FUSES_BOD33ACTION_Msk       (0x3u << FUSES_BOD33ACTION_Pos)
#define FUSES_BOD33ACTION(value)    ((FUSES_BOD33ACTION_Msk & ((value) << FUSES_BOD33ACTION_Pos)))

#define FUSES_BOD33EN_ADDR          HFLASHC_USER
#define FUSES_BOD33EN_Pos           7            /**< \brief (HFLASHC_USER) BOD33 Enable */
#define FUSES_BOD33EN_Msk           (0x1u << FUSES_BOD33EN_Pos)

#define FUSES_BOD33LEVEL_ADDR       HFLASHC_USER
#define FUSES_BOD33LEVEL_Pos        1            /**< \brief (HFLASHC_USER) BOD33 Level */
#define FUSES_BOD33LEVEL_Msk        (0x3Fu << FUSES_BOD33LEVEL_Pos)
#define FUSES_BOD33LEVEL(value)     ((FUSES_BOD33LEVEL_Msk & ((value) << FUSES_BOD33LEVEL_Pos)))

#define FUSES_BOD33_HYST_ADDR       HFLASHC_USER
#define FUSES_BOD33_HYST_Pos        10           /**< \brief (HFLASHC_USER) BOD33 Hysteresis */
#define FUSES_BOD33_HYST_Msk        (0x1u << FUSES_BOD33_HYST_Pos)

#define WDT_FUSES_WDTAUTO_ADDR      HFLASHC_USER
#define WDT_FUSES_WDTAUTO_Pos       0            /**< \brief (HFLASHC_USER) Watchdog Enabled at Reset */
#define WDT_FUSES_WDTAUTO_Msk       (0x1u << WDT_FUSES_WDTAUTO_Pos)

/*@}*/

#endif /* _SAM4L_FLASHCALW_COMPONENT_ */
